// AboutTeamDetail.js
import React from 'react';
import { Link, useLocation } from 'react-router-dom';
import './AboutTeamDetail.css';
import { Spoiler } from '@mantine/core';
import Card from './Card'; // Import the Card component
import { GoArrowRight } from "react-icons/go";
function AboutTeamDetail() {
    const location = useLocation();
    
    const { header = 'حول النادي', image ='../../assets/images/time_with_slide_card.png', image1 = '', innerhead = 'فكرة تأسيس نادي الكرامة الرياضي', text = 'Default text' } = location.state || {};

    // Sample data for cards
    const cardData = [
        {
            title: 'نادي خالد ابن الوليد',
            // image: '../../assets/images/card_image1.png',
            description: 'تأسس نادي خالد بن الوليد عام 1928 في زمن الاحتلال الفرنسي عبر شباب المدينة الذين فكروا في تأسيس نادي رياضي يضمهم ويسمح لهم بممارسة الرياضية بشكل رسمي فتنادى كل من خالد مورهلي وهو من دمشق والصيدلي ليان طرابلسي وعبد القادر الجمالي وحيدر الدروبي وصلاح الحسيني وممدوح موصلي وعبد الرحمن رشاد ونصوح وياسر وجمعة وشوكت ورأفت الأتاسي وعبد المؤمن الشيخة وبرهان الدروبي ورضا الجمالي وأسسوا النادي وكان باكورة بطولاته بلعبة كرة القدم في 25 نيسان 1948 حيث فازوا ببطولة القطر ممثلين لمنتخب حمص بعد فوزهم في المباراة النهائية على منتخب حلب بهدفين لهدف بعد التمديد، وسجل الهدف الأول المربي ساطع الأتاسي والهدف الثاني قصي الجابري، وحافظ نادي خالد على لقبه في العام التالي ثم عاد ليفوز ببطولة سوريا عام 1952وكانت لعبة كرة القدم اللعبة الرئيسية في هذا النادي..'
        },
           
{
    title: 'نادي التضامن',
    // image: '../../assets/images/card_image2.png',
    description:`تأسس عام 1953 لحاجة أبناء المدينة الماسة لممارسة ألعاب القوة ونشرها بين الشباب، ومارس النادي ألعاب المصارعة والملاكمة وكان مقره في نهاية شارع الدبلان، وكان النادي يضم غرفاً كبيرة لممارسة هذه الألعاب، وحافظ النادي على بطولات المدينة لسنوات طويلة مع المنافسة القويّة من باقي الأندية ومن أبطاله بالملاكمة عبد الرحيم مصطفى وعبد الرحيم جنيد وفؤاد عبد المولى وماهر برغوث وخضير شمالية الذين مارسوا اللعبة بإشراف مروان الأمين.. ومن ثم عبد الحكيم أفيوني اما في المصارعة فنذكر فوزي سلوم وعبد الجواد قباني وفيصل زهرة ومحمد ديب الطيار.
`},

{
    title: 'نادي الطلائع',
    // image: '../../assets/images/card_image2.png',
    description:`نال ترخيصه عام 1953، ومارس ألعاب القوى وكان مقره في حي جورة الشياح ومن أبرز مؤسسيه صالح طليمات وعبد الوهاب الكيال ووترأسه الدكتور غصوب الرفاعي وزير الصحة السابق ومن أبرز لاعبيه بالمصارعة: راتب بالي وساطع طليمات وعبد الجليل واضوح الفاخوري وعبد السلام نعمان.أما على صعيد لعبة الملاكمة فنذكر موسى مكحل وأحمد عز الدين وإبراهيم أبو حجاب وسليم عيساوي وفي لعبة رفع الأثقال نذكر نبيه طليمات وعدنان مكحل وفي لعبة كمال الأجسام ممدوح طليمات وممدوح دربي.`},


    {
        title: 'نادي الوحدة',
        image: '../../assets/images/card_image3.png',
        description: `تأسس في 25 شباط 1958، حيث انفصلت مجموعة كبيرة من نادي خالد بن الوليد لتنضوي تحت اسم نادي الوحدة، ومن أبرز الذين توالوا على رئاسة النادي الأستاذ ساطع الأتاسي والمحامي نورس السباعي والسيد زهير طليمات والسيد راتب الخضري ومن أبرز لاعبيه : نور الدين تركماني – عمر صالح أغا – مروان الشبعان - فهد الرئيس – راكان الرئيس – خضر المسدي – بدوي المسدي – فاضل جنيد – عبد الحفيظ عرب – جميل جرو – ملاذ السباعي – غزوان زهرة – رياض البوشي – جلاء إلياس – فواز شاهرلي.
مارس النادي ألعاب كرة القدم وكرة السلة وكرة الطائرة وكرة اليد وتنس الطاولة وكرة المضرب وألعاب القوى والسباحة والدراجات.
فاز ببطولة حمص في السباحة وكرة المضرب والدراجات وبكافة الفئات بالفترة من عام 1960 ولغاية عام 1968، ونال بطولة أندية الدرجة الأولى في كرة اليد عام 1968، ونال بطولة حمص بألعاب القوى عامي 1964 و1965 ونال بطولة حمص لفئة الأشبال عام 1967 وأشبال تنس الطاولة بحمص عام 1966 وانتزع بطولة حمص من نادي الجهاد عام 1967.
في عام 1963، اعتمد نادي الوحدة على مجموعة من الأشبال الذين تفرغ لتدريبهم السيد بدوي المسدي، ومن اللاعبين الذين كانوا يشكلون العمود الفقري للفريق : عبد الحفيظ عرب – جميل جرو – فواز شاهرلي – ملاذ السباعي – جلاء إلياس وانضم إليهم فيما بعد فاضل جنيد- عمر خليل – غزوان زهرة....وشكل هذا الفريق خطراً على فرق الأندية الأخرى بعد دفعه إلى الملعب لملاقاة المخضرمين.استقدم النادي عدة فرق بكرة القدم كفريق القوة الجوية عام 1958 وفريق روماني عام 59 وفريق النجوم الأمريكي عام 62 ونادي الصفاء اللبناني والجامعة الأمريكية عام 1960 وشبيبة المزرعة اللبناني عام 1968.
بدأ نضال الفريق في بطولات المناطق والتي كانت تمهيداً للاشتراك في الدوري الممتاز والذي أقيم ولأول مرة في سوريا إلا أنه لم يوفق للمشاركة فيه لعدم فوزه ببطولة المناطق حيث كانت فرق أندية الجهاد وخالد بن الوليد والتضامن والطلائع، والتي تشكل اليوم بمجموعها نادي الكرامة، بعيدة عن نشاطاتها لأسباب مختلفة، وكان منافسه آن ذاك نادي الفداء (الوثبة حالياً) والذي مثل مدينة حمص في تلك المسابقة.
كانت تلك المشاركة عبرة للنادي وفي موسم 1966 - 1967 استطاع الفوز ببطولة أندية الدرجة الأولى، إلا أن اتحاد كرة القدم في تلك الفترة أوجد أسباباً أبعد بموجبها نادي الوحدة (الكرامة حاليا) عن البطولة وفوت عليه الفرصة، ومع ذلك استطاع التادي المجتهد في العام التالي أن يفوز ببطولة أندية الدرجة الأولى ومن ثم سطع نجمه بين أندية الدرجة الممتازة منذ ذاك الحين.`   },

{
    title: 'نادي الجهاد',
    // image: '../../assets/images/card_image2.png',
    description:`بدأ أبناء نادي الجهاد يمارسون الرياضة في هذا النادي في 17 نيسان 1948، ولكن صغر سن مؤسسيه لم يمنح النادي الترخيص النظامي حتى عام 1952 حيث تم تأسس النادي رسمياً وأسس تحت اسم نادي اليقظة في حي بستان الديوان، وترأسه آنذاك السيد أنيس ناصر وضم في عضويته جورج حنا – إحسان مطر – إيلي ناصر – إنعام غاوي – سري ناصيف، ورعتهم السيدة سلمى ختن، ومنحتهم خزانة في منزلها وفسحة سماوية من باحة المنزل للنشاط الرياضي وكانت اللعبة الرئيسية في النادي الكرة الطائرة حيث بقي بطلاً لمدينة حمص لمدة عشرون عاماً متتالية، وبرز منه اللاعبين أكرم خزام وإحسان مطر بلعبتي كرة الطائرة وكرة السلة وكان أكرم من أكثر اللاعبين تمثيلاً للمنتخب الوطني لمدة عشرة أعوام متتالية خلال فترة الخمسينيات، وإحسان مطر الذي مثل منتخب الجمهورية العربية المتحدة عام 1959 والذي كان يضم القطرين الشقيقين مصر وسوريا، كما ظهر معهما ظافر مسوح وأكرم غراب، بعد ذلك انتقل مقر النادي إلى حي المحطة بجانب المركز الثقافي العربي، ومن أبرز أعضائه السيد سميح اسكندر الإداري الناجح ولاعب كرة القدم المتألق، وسري صواف أمين سر النادي ورفعت مره ومنيف مسوح وشاكر حارس وعبودي غاوي ونديم ناصر، ومن خريجي المعهد العالي في جمهورية مصر العربية ممدوح حداد وأنطوان مطر وكانت لعبة كرة السلة في هذا النادي المنافسة الدائمة لنادي حمص الأهلي على بطولة المدينة.
نادي الجهاد أول نادي في مدينة حمص مارست فيه المرأة الرياضة، حيث أسس أول فريق للسيدات بكرة السلة وكرة الطائرة عام 1957 ونال بطولة حمص وسوريا عدة سنوات كما مارس لعبة الدراجات وتنس الطاولة وكان من أبرز لاعباته ندوة شاهين بطلة سوريا لمدة خمس سنوات.`
},
];

    return (
        <div className='parent'>
            <div><p className='head'>{header}</p></div>
            <div className='rw'>
                <div className='pic'>
                    <img src={require('../../assets/images/time_with_slide_card.png')}  className='img1' alt='pic for team' />
                    {/* <img src={image1} className='img2' alt='' /> */}
                </div>
                    
                <div className='text'>
                    <div className='innerhead'>
                        <p>{innerhead}</p>
                    </div>
                    <div className='innertext'>
                        <Spoiler maxHeight={350} showLabel="عرض المزيد" hideLabel="أقل" style={{ width: '550px' }}>
                            <div>
                            ونادي الكرامة هو حصيلة دمج عدة أندية أهلية في مدينة حمص وهي أندية خالد بن الوليد – الوحدة – الجهاد – التضامن – الطلائع وكانت هذه الأندية تمارس الألعاب الرياضية بشكل اختصاصي ويعدّ ناديا خالد بن الوليد والوحدة النواة الأساسية لنادي الكرامة

                            </div>  
                        </Spoiler>
                    </div>
                    <div className='icon-container'>
   <Link to="/about"> <GoArrowRight style={{ width: '900px', height: '50px' ,  color: 'Navy'}} /></Link>
    </div>
                </div>
            </div>
            
            {/* Render the cards */}
            <div className='cards-container'>
                {cardData.map((card, index) => (
                    <Card 
                        key={index} 
                        title={card.title} 
                        image={card.image} 
                        description={card.description} 
                    />
                ))
                }
            </div>
        </div>
        
    );
}

export default AboutTeamDetail;